Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: གང་ ལ་ བསལ་བ་ ཡང་ མེད །_ |#| བཞག་པ་ ཡང་ མེད་པ་ འདི་ ནི་ ཆོས་ རྣམས་ ཀྱི་ འཛིན་པ་ ཞེས་ བྱ་ སྟེ །_
en: Those who are free of removing and establishing are called graspers of dharmas .

source: དེས་ན་ བྱང་ཆུབ་ སེམས་དཔའ་ ཞེས་ བྱ འོ །_།
en: Therefore, they are called bodhisattvas .

source: ཤ་ར་དྭ་ཏི འི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཞེས་ བྱ་བ་ ནི །_ ཤ་ར་དྭ་ཏི འི་ བུ་ སངས་རྒྱས་ རྣམས་ དང་ ཉེ་བ འི་ སེམས་དཔའ་ ཡིན་པ ས་ དེས་ན་ བྱང་ཆུབ་ སེམས་དཔའ་ ཞེས་ བྱ འོ །_།
en: Since bodhisattvas, Śāradvatī­putra, are beings ( sattva ) who are close to the buddhas, they are called bodhisattvas .

source: བྱང་ཆུབ་ མེད་པ འི་ ཕྱིར་ བྱང་ཆུབ་ སེམས་དཔའ་ ཞེས་ བྱ འོ །_།
en: Since there is no awakening ( bodhi ), they are called bodhisattvas .

source: ཡང་ སེམས་དཔའ་ དེ་ སེམས་ཅན་ མེད་པ་ ཉིད་ ཀྱིས་ བྱང་ཆུབ་ ལ་ འཇུག་ པ ར་ བྱེད་པ ས་ དེས་ན་ བྱང་ཆུབ་ སེམས་དཔའ་ ཞེས་ བྱ འོ །_།
en: Alternatively, since the being ( sattva ) enters awakening due to the very non-existence of beings, they are therefore called bodhisattvas.

source: !ཤ་ར་དྭ་ཏི འི་ བུ་ ཡང་ གལ་ཏེ་ བྱང་ཆུབ་ སེམས་དཔའ་ བརྟན་ ན་ ནི་ དེ་ འདི་ལྟར་ བསྟན་པ་ བྱས་པ ར་ འགྱུར་ ཏེ །_
en: $1060 “Śāradvatī­putra, alternatively, if bodhisattvas were to teach,#47 they would teach in this way.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ བསྟན་པ་ མེད་པ་ ནི་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡིན་པ འི་ ཕྱིར་ རོ །_།
en: That is why, |#| Śāradvatī­putra, being without a teaching is being a bodhisattva.

source: གང་ གིས་ བསྟན་ དུ་ མེད་ ཅེ་ན །_
en: Who has nothing to teach?

source: གང་ གིས་ ཀྱང་ བསྟན་ དུ་ མེད་པ ས་ དེས་ན་ བསྟན་པ་ ཞེས་ བྱ འོ །_།
en: No one at all has anything to teach. |#| Therefore, teaching is so termed.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དགའ་བ་ དང་ ལྡན་པ་ དེ་དག་ ནི་ གཉིས་ སུ་ མེད་པ་ ལ་མོ ས་པ་ སྟེ །_
en: Śāradvatī­putra, joyous, they are inclined toward nonduality,

source: དེ་དག་ ནི་ ཆོས་ སུ་ སྨྲ་བ འང་ མ་ ཡིན །_ |#| ཆོས་མ་ ཡིན་པ ར་ སྨྲ་བ འང་ མ་ཡིན་པ ས་ དེས་ན་ བྱང་ཆུབ་ སེམས་དཔའ་ དག་ [129a] ཅེས་ བྱ འོ །_།
en: for they preach neither Dharma nor non-Dharma. |#| Thus are bodhisattvas so termed. [129.a]

source: ཤ་ར་དྭ་ཏི འི་ བུ་ གཞན་ ཡང་ བྱང་ཆུབ་ ཅེས་བྱ་བ་ ནི་ སྟོང་པ་ཉིད་ གང་ཡིན་པ་ དེ་ ནི་ བྱང་ཆུབ་བོ །_།
en: $1061 “Moreover, Śāradvatī­putra, awakening is awakening to emptiness.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ སྟོང་པ་ཉིད་ ཅེས་བྱ་བ་ ཅིས་ སྟོང་པ་ ཞེ་ན །_
en: And emptiness , Śāradvatī­putra, is emptiness of what?

source: ཆོས་ ཐམས་ཅད་ ཀྱིས་ སྟོང་ ངོ་ །_།
en: It is emptiness of any phenomena.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ཆོས་ སུ་ འདུ་ཤེས་པ་ ཡོད་ ན་ ཡང་ འདུ་ ཤེས་ སུ་ འཛིན་པ་ ཉིད་ དུ་ འགྱུར །_ |#| བདག་ ཏུ་ འཛིན་པ་ ཉིད་ དུ་ འགྱུར །_ |#| སེམས་ཅན་ དུ་ འཛིན་པ་ དང་ །_ སྲོག་ ཏུ་ འཛིན་པ་ དང་ །_ གང་ཟག་ ཏུ་ འཛིན་པ་ དང་ །_ འཛིན་པ་ ཐམས་ཅད་ ཀྱི་ འཛིན་པ ར་ འགྱུར་བ་ དེས་ན་ འདུ་ཤེས་ སུ་ འཛིན་པ་ ཞེས་ བྱ འོ །_།
en: Śāradvatī­putra, if there is anything perceived as a phenomenon, there will be grasping to that perception, grasping as self, grasping as a being, grasping as a life force, grasping as a person, and the grasping of all grasping. |#| Therefore, grasping to perception is so termed.

source: དེ་ ལ་ དེ་ མེད་པ ས་ དེས་ན་ སྟོང་པ་ཉིད་ ཅེས་ བྱ་ སྟེ །_
en: The absence of that is termed emptiness ; |#| and

source: སྟོང་པ་ཉིད་ གང་ཡིན་པ་ དེ་ ནི་ བྱང་ཆུབ་བོ །_།
en: emptiness is awakening.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ གཞན་ ཡང་ ཆོས་ ཐམས་ཅད་ ནི་ བྱང་ཆུབ་ སྟེ །_ |#| དེ་བཞིན་ དུ་ མངོན་པར་ རྫོགས་པ ར་ སངས་རྒྱས་པ་ ཡིན་ གྱིས་
en: Moreover, Śāradvatī­putra, all phenomena are awakening, and likewise, perfect buddhahood. |#| Thus,

source: འཐུན་ པར་ བྱོས་ ལ་ མི་ འཐུན་ པར་མ་ བྱེད་ ཅིག _།
en: act in harmony and do not act in disharmony with this.

source: བྱང་ཆུབ་ ནི་ ཟབ་པ འི་ ཕྱིར་ ཏེ །_ |#| གང་ ལ་ བྱིས་པ་ སོ་སོ འི་ སྐྱེ་བོ་ ཐམས་ཅད་ འགྲོ་བ་ མེད་པ་ དེ་ཙམ་ དུ་ ཟབ་བོ །_།
en: This is because awakening is profound—so profound that no immature, ordinary beings progress toward it.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ བྱིས་པ་ དག་ ལྟ་ཞོག་ གི _། ཤ་ར་དྭ་ཏི འི་ བུ་ དགྲ་བཅོམ་པ་ དང་ །_ རང་ སངས་རྒྱས་ རྣམས་ ཀྱང་ ཟད་པ་ ཤེས་པ་ ལ་ རྣམ་པར་ ལྟ་བ ར་ བྱེད་ ཅིང་ །_ མི་ སྐྱེ་བ་ ཤེས་པ་ ལ་ རྣམ་པར་ ལྟ་ བ ར་ བྱེད་ ལ །_ མི་ སྐྱེ་བ་ ཤེས་པ་ མངོན་དུ་ བྱེད་ ཀྱང་ དེ་ ལ་ འགྲོ་བ་ མེད་ དོ །_།
en: And moreover, Śāradvatī­putra, let alone ordinary beings, even worthy ones and solitary buddhas do not progress toward it, despite having actualized knowledge of non-arising, from beholding the knowledge of exhaustion and the knowledge of non-arising.

source: གང་ ཟད་པ ར་ བྱ་བ འི་ ཕྱིར་ ཟད་པ་ ཤེས་པ་ ཞེས་ བྱ་ ཞེ་ན །_
en: Knowledge of exhaustion comes from bringing what to exhaustion?

source: ཆོས་ གང་ཡང་ ཟད་པ ར་ བྱ་བ འི་ ཕྱིར་ ཟད་པ་ ཤེས་པ་ མ་ ཡིན་ ནོ །_།
en: Knowledge of exhaustion does not come from bringing any phenomenon to exhaustion.

source: གཞན་ ཡང་ ཆོས་ ཐམས་ཅད་ ཀྱི་ ཟད་པ་ ཉིད་ པས་ དེས་ན་ ཟད་པ་ ཤེས་པ་ ཞེས་ བྱ འོ །_།
en: Moreover, it is because all phenomena themselves are exhausted that knowledge of exhaustion is so termed.

source: ཤེས་པ་ དེ་ འཕགས་པ་ རྣམས་ ཀྱི་ ཡིན་པ ས་ དེས་ན་ ཟད་པ་ ཤེས་པ་ ཞེས་ བྱ འོ །_།
en: It is because that knowledge belongs to noble beings that knowledge of exhaustion is so termed.

source: འདི་ སྙེད་ ཟད་ དོ་ ཞེས་ ཤེས་པ་ དེ་ལྟ་ བུ་ མེད་པ་ དང་ །_ དེ་ལྟ ར་ ཟད་ དོ་ ཞེས་ ཤེས་པ་ དེ་ལྟ་ བུ་ མེད་པ་ དང་ །_ འདི་ ཕན་ཆད་ ཟད་ དོ་ ཞེས་ ཤེས་པ་ དེ་ལྟ་ བུ་ མེད་པ ས་ དེས་ན་ ཟད་པ་ ཤེས་པ་ ཞེས་ བྱ འོ །_།
en: Knowledge of exhaustion is so termed because there is no knowledge such as, ‘All this was exhausted,’ ‘Such and such was exhausted,’ or ‘Everything from here on was exhausted.’

source: དེས་ ན་ ཉན་ཐོས་ དང་ །_ རང་ སངས་རྒྱས་ རྣམས་ ཀྱང་ བྱང་ཆུབ་ ཏུ་ འགྲོ་བ་ མེད་ ཅེས་ བྱ འོ །_།
en: Therefore, it is said that not even worthy ones or solitary buddhas progress toward awakening.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ མི་ སྐྱེ་བ་ ཞེས་ ཅིའི་ཕྱིར་ བྱ་ ཞེ་ན །_
en: $1062 “Śāradvatī­putra, why is non-arising so called?

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ ལ་ ཕྲ་རབ་ ཙམ་ ཡང་ སྐྱེ་བ་ མེད་པ ས་ དེས་ན་ མི་ སྐྱེ་བ་ ཞེས་ བྱ འོ །_།
en: Śāradvatī­putra, it is because not even the subtlest particle has arising that non-arising is so called.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ ལ་ ཤེས་པ་ གང་ཡིན་པ་ འདི་ ནི་ མི་ སྐྱེ་བ་ [129b] ཤེས་པ་ ཞེས་ བྱ འོ །_།
en: Śāradvatī­putra, the knowledge of that is called knowledge of non-arising. [129.b]

source: ཉན་ཐོས་ རྣམས་ ལ་ འདི་ ནས་ མི་ སྐྱེ་བ་ དེ འོ་ ཞེས་ ཤེས་པ་ དེ་ མེད་པ་ དང་ །_ ཉན་ཐོས་ རྣམས་ ལ་ འདི་ ཕན་ཆད་ མི་ སྐྱེ འོ་ ཞེས་ ཤེས་པ་ དེ་ མེད་པ ས་ དེས་ན་ སངས་རྒྱས་ རྣམས་ ཀྱི་ ཡེ་ཤེས་ མཐའ་ཡས་པ་ ཞེས་ བྱ འོ །_།
en: $1063 “It is because hearers lack the knowledge that ‘that does not arise from this,’ or ‘this will henceforth not arise,’ that the limitless wisdom of buddhas is so called.

source: ཅིའི་ཕྱིར་ སངས་རྒྱས་ ཀྱི་ ཡེ་ཤེས་ མཐའ་ཡས་པ་ ཞེ་ན །_
en: Why is the wisdom of a buddha limitless?

source: ཡེ་ཤེས་ དེ་ མཉམ་པ་ མེད་ ཅིང་ མཐའ་མེད་ པས་ དེས་ན་ སངས་རྒྱས་ ཀྱི་ ཡེ་ཤེས་ དེ་ མཐའ་ཡས་པ་ ཞེས་ བྱ འོ །_།
en: Since that wisdom has no parallel and no limit, the wisdom of a buddha is called limitless .

source: ཡེ་ཤེས་ དེ་ ཡུལ་མེད་པ་ ཡིན་པ ས་ དེས་ན་ སངས་རྒྱས་ ཀྱི་ ཡེ་ཤེས་ ཞེས་ བྱ འོ །_།
en: Since that wisdom is devoid of object, the wisdom of a buddha is so called.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ སངས་རྒྱས་ ཀྱི་ ཡེ་ཤེས་ ཞེས་ བྱ་བ་ ཇི་སྐད་ དུ་ བསྟན་པ་ ཡིན་ ཞེ་ན །_
en: $1064 “Śāradvatī­putra, how is the wisdom of a buddha taught to be?

source: ཡེ་ཤེས་ དེ་ སངས་རྒྱས་པ་ ཡིན་པ ས་ དེས་ན་ སངས་རྒྱས་ ཀྱི་ ཡེ་ཤེས་ ཞེས་ བྱ འོ །_།
en: Since that wisdom is awakened to, it is called the wisdom of a buddha .

source: ཡེ་ཤེས་ དེ་ བཙལ་བ་ ཡིན་པ ས་ དེས་ན་ སངས་རྒྱས་ ཀྱི་ ཡེ་ཤེས་ ཞེས་ བྱ འོ །_།
en: Since that wisdom is sought after, it is called the wisdom of a buddha .

source: ཤ་ར་དྭ་ཏི འི་ བུ་ སངས་རྒྱས་ ཞེས་ བྱ་བ་ ཇི་སྐད་ དུ་ བསྟན་པ་ ཡིན་ ཞེ་ན །_
en: Śāradvatī­putra, how is buddha taught to be?

source: ཤ་ར་དྭ་ཏི འི་ བུ་ སེམས་ཅན་ འདི་དག་ ནི་ འགྱུར་བ་ ཡིན །_
en: Śāradvatī­putra, beings are fickle.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ སེམས་ཅན་ འདི་དག་ ནི་ གནས་ འདི་ ནས་ ཀུན་ དུ་ རྒྱུག་པ་ ཡིན །_ |#| ཁོང་ དུ་མ་ ཆུད་པ་ ཡིན་ ཏེ །_
en: Śāradvatī­putra, beings flee from this state, and fail to comprehend it.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེས་ ནི་ ཆོས་ ཐམས་ཅད་ སངས་རྒྱས་ པས་ དེས་ན་ སངས་རྒྱས་ ཞེས་ བྱ འོ །_།
en: Yet, Śāradvatī­putra, the buddhas have awakened to all phenomena, and therefore they are called buddhas.

source: ཇི་ལྟ ར་ ཆོས་ ཐམས་ཅད་ སངས་རྒྱས་ ཞེ་ན །_
en: And how have they awakened to all phenomena?

source: ཇི་ལྟ ར་ ཆོས་ དེ་དག་ མེད་པ་ དང་ །_ ཆོས་མ་ ཡིན་པ་ མེད་པ་ དང་ །_ དེ་དག་ ཀུན་ ནས་ ཉོན་མོངས་པ་ མེད་པ་ དང་ །_ རྣམ་པར་ བྱང་བ་ མེད་པ་ དང་ །_ དེ་དག་ འདས་པ་ མེད་པ་ དང་ །_ མ་འོངས་པ་ མེད་པ་ དང་ །_ ད་ལྟ ར་ བྱུང་བ་ མེད་པ་ དེ་ལྟ ར་ སངས་རྒྱས་ སོ །_།
en: They have awakened to the very fact that there are neither phenomena nor non-phenomena, neither affliction nor purification, and that there is no present, past, or future.

source: ཇི་ལྟ ར་ གང་ ཡང་ སྐྱེ་བ འམ །_ འཇུག་པ འམ །_ ཟད་པ འམ །_ འོང་བ འམ །_ འགྲོ་བ འམ །_ ཀུན་ ནས་ ཉོན་མོངས་པ འམ །_ རྣམ་པར་ བྱང་བ འམ །_ འགག་པ་ མེད་པ་ དེ་ལྟ ར་ སངས་རྒྱས་ སོ །_།
en: They have awakened to the very fact that there is no arising, engagement, exhaustion, coming, going, affliction, purification, or cessation at all.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ གཞན་ ཡང་ མཐའ་ ཡ ས་ ཤིང་ དཔག་ ཏུ་ མེད་ ལ་ གཏིང་དཔག་ དཀའ་ ཞིང་ ཁོང་ དུ་ ཆུད་པ ར་ དཀའ་བ ས་ སངས་རྒྱས་ ཏེ །_
en: $1065 “Moreover, Śāradvatī­putra, since, being limitless and immeasurable, they are difficult to fathom and comprehend, they are awakened.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ འདི་ལྟ་སྟེ་ དཔེར་ན །_
en: Śāradvatī­putra, it is like the following analogy.

source: རྒྱ་མཚོ་ ཆེན་པོ་ ནི་ རོ་ གཅིག་པ་ དང་ །_ བྲི་བ་ དང་ གང་བ་ མེད་པ་ དང་ ཟབ་པ་ ཡིན་ ནོ །_།
en: The ocean is of a single taste, free of being filled or depleted, and deep.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ དུ་ དེ་བཞིན་ གཤེགས་པ འི་ རྒྱ་མཚོ་ ཡང་ འདི་ལྟ་སྟེ །_
en: So, too, Śāradvatī­putra, is the ‘ocean’ of a thus-gone one.

source: རྣམ་པར་ གྲོལ་བ འི་ རོ་ དང་ [130a] སྐྱེ་བ་ མེད་པ འི་ རོ་ དང་ །_ ཟད་པ་ མེད་པ འི་ རོ ར་ རོ་ གཅིག་ ཅིང་ ཆོས་ ཟབ་མོ་ སྟོན་པ འི་ ཕྱིར་ རིམ་གྱིས་ ཆོས་སྟོན་པ་ ལ་ གཞོལ་བ་ དང་ །_ ཐེ་ཙོམ་ ཐམས་ཅད་ གཅོད་པ འི་ ཕྱིར་ ཞུ་བ འི་ ཆུ་ ཐམས་ཅད་ ལེན་པ་ དང་ །_ ཆོས་ ཐམས་ཅད་ མི་ བརྗེད་པ འི་ ཕྱིར་ བྲི་བ་ མེད་པ་ དང་ །_ ཆོས་ གནས་པ་ ཉིད་ ཀྱི་ ཕྱིར་ གང་བ་ མེད་པ འོ །_།
en: Because he teaches the profound Dharma with the taste of liberation, [130.a] the taste of non-arising, and the taste of non-exhaustion as its single taste, he collects them progressively into his teaching of Dharma; |#| because he resolves all doubts he absorbs all the waters of questions; |#| because he does not forget any Dharma he is without depletion; |#| and because he is the very presence of Dharma there is no filling him.#48

source: ཤ་ར་དྭ་ཏི འི་ བུ་ གཞན་ ཡང་ གལ་ཏེ་ སངས་རྒྱས་ བསྟན་པ ར་ གྱུར་ ན་ འདི་ ལ་ སུ་ཞིག་ ཡིད་ཆེས་ པར་ བྱེད་ དེ །_
en: $1066 “Moreover, Śāradvatī­putra, when the nature of a buddha is explained, who can comprehend that topic?

source: ཀླུ འི་ རྒྱལ་པོ་ ཆེན་པོ་ རྒྱ་མཚོ་ ནི་ ཆར་ འབེབས་པ་ ན་ འདི་ལྟ་སྟེ །_
en: When the great nāga king Sāgara (Ocean) makes it rain,

source: རྒྱ་མཚོ་ ཆེན་པོ ར་ རང་ གི་ གནས་ ཁོ་ན ར་ ཆར་ འབེབས་པ ར་ བྱེད་ དོ །_།
en: he does so only in his own place, the ocean.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ གང་ ཀླུ འི་ རྒྱལ་པོ་ རྒྱ་མཚོ འི་ ཆུ འི་ རྒྱུན་ བཟོད་པ ར་ ནུས་པ འི་ ས འི་ ཕྱོགས་ དེ་ གང་ཡང་ མེད་པ འི་ ཕྱིར་ ཏེ །_ |#| དེ་བཞིན་ གཤེགས་པ ས་ བྱིན་ གྱིས་ བརླབས་པ་ ནི་ མ་གཏོགས་ སོ །_།
en: This is because, Śāradvatī­putra, there is no place whatsoever, aside from a place consecrated by a thus-gone one, that can withstand the torrent of water from the great nāga king Sāgara.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ དུ་ གལ་ཏེ་ དེ་བཞིན་ གཤེགས་པ་ དེ་བཞིན་ གཤེགས་པ འི་ ཆོས་ཉིད་ སྟོན་ ཅིང་ །_ སངས་རྒྱས་ ཀྱི་ ཡེ་ཤེས་ ཀྱི་ མཚན་ཉིད་ གསུང་ ཡང་ །_
en: In the same way, Śāradvatī­putra, when a thus-gone one teaches on the nature of a thus-gone one and speaks about the characteristics of a buddha’s wisdom,

source: ཤ་ར་དྭ་ཏི འི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཐེག་པ་ ཆེན་པོ་ ལ་ ཡང་དག་ པར་ ཞུགས་པ །_ དེ་བཞིན་ གཤེགས་པ ས་ བྱིན་ གྱིས་ བརླབས་པ་ མ་གཏོགས་ པར་ གང་ ཀུན་ཤེས་ པར་ ནུས་པ འི་ ཉན་ཐོས་ སམ །_ རང་ སངས་རྒྱས་ སམ །_ སེམས་ཅན་ འགའ་ཡང་ སེམས་ཅན་ གྱི་ རིས་ ན་ ངས་ ཡང་དག་ པར་ རྗེས་སུ་ མ་ མཐོང་ ངོ་ །_།
en: I have never seen in the realms of beings any hearer, solitary buddha, or ordinary being who can understand it fully, that is, aside from a bodhisattva who has perfectly embarked on the Great Vehicle and been authorized by a thus-gone one.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ གནས་ བཞི་པོ་ འདི་དག་ ནི་ རྟོགས་པ ར་ དཀའ་ ཞིང་ རྙེད་པ ར་ དཀའ་ ལ་ ཤིན་ཏུ་ མཆོག་ ཏུ་ རྙེད་པ ར་ དཀའ་བ་ སྟེ །_ |#| དེ་དག་ དེ་རིང་ ཐོབ་བོ །_
en: $1067 “Śāradvatī­putra, there are four things, difficult to understand and extremely difficult to obtain, that today you have.

source: བཞི་པོ་ དེ་དག་ གང་ཞེ་ན །_
en: What are these four?

source: ཤ་ར་དྭ་ཏི འི་ བུ་ མི་ ཉིད་ ཤིན་ཏུ་ མཆོག་ ཏུ་ རྙེད་པ ར་ དཀའ་བ་ ཡིན །_
en: Śāradvatī­putra, human birth is exceedingly difficult to obtain.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ འབྱུང་བ་ ཤིན་ཏུ་ མཆོག་ ཏུ་ རྙེད་པ ར་ དཀའ་བ་ ཡིན །_
en: Śāradvatī­putra, the emergence of a thus-gone one is exceedingly difficult to obtain.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ གཤེགས་པ འི་ བསྟན་པ་ ལ་ དད་པ་ ཤིན་ཏུ་ མཆོག་ ཏུ་ རྙེད་པ ར་ དཀའ་བ་ ཡིན །_
en: Śāradvatī­putra, faith in a thus-gone one’s teaching is exceedingly difficult to obtain. |#| And,

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དད་པ་ རྙེད་ ནས་ གནས་ དང་ གནས་མ་ ཡིན་པ་ དྲི་བ་ ཤིན་ཏུ་ མཆོག་ ཏུ་ རྙེད་པ ར་ དཀའ་བ་ ཡིན་ ཏེ །_
en: Śāradvatī­putra, having gained faith, it is exceedingly difficult to obtain an audience to inquire about what is tenable and what is untenable.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ གནས་ བཞི་པོ་ དེ་དག་ ནི་ ཤིན་ཏུ་ མཆོག་ ཏུ་ རྙེད་པ ར་ དཀའ་ ཞིང་ །_ རྟོགས་པ་ དཀའ་བ་ སྟེ །_ |#| དེ་དག་ ཁྱེད་ [130b] ཅག་ གིས་ ཐོབ་བོ །_།
en: Śāradvatī­putra, these four things, so exceedingly difficult to obtain and understand, you have obtained. [130.b]

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཁྱེད་ཅག་ ཆོས་ གང་ ལ་ ཐེ་ཙོམ་ ཡོད་པ་ ང་ ལ་ དྲིས་ ཤིག་ དང་ །_
en: $1068 “Śāradvatī­putra, ask me about any teaching with which you have doubt!

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཁྱོད་ ལྷ་ དང་ བཅས་པ འི་ འཇིག་རྟེན་ ལ་ སྐབས་ དབྱེ འོ །_།
en: Śāradvatī­putra, you should take this opportunity on behalf of the world with its gods!

source: ཤ་ར་དྭ་ཏི འི་ བུ་ རིང་པོ་ མི་ ཐོགས་པ ར་ ང་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་ ནས །_
en: Śāradvatī­putra, since I will pass away before too long, and

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཕྱིས་ འགྱོད་ པ ར་ གྱུར་ ན་ མི་ རུང་ གིས་ ང་ ལ་ དྲིས་ ཤིག _།
en: since, Śāradvatī­putra, it would not be fitting for you to have regrets later, ask me!”

source: དེ་ནས་ ཚེ་ དང་ ལྡན་པ་ ཤ་ར་དྭ་ཏི འི་ བུ་ སྟན་ ལས་ ལངས་ ཏེ །_ |#| བླ་གོས་ ཕྲག་པ་ གཅིག་ ཏུ་ གཟར་ ནས །_ |#| པུས་མོ་ གཡས་པ འི་ ལྷ་ང་ ས་ ལ་ བཙུགས་ ཏེ །_ |#| བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: $1069 Then the venerable Śāradvatī­putra rose from his seat, draped his robe over one shoulder, knelt on his right knee, and said to the Blessed One,

source: གལ་ཏེ་ ཞུས་ ནས་ ཞུ་བ་ ལུང་བསྟན་པ འི་ སླད་ དུ །_ བཅོམ་ལྡན་འདས་ ཀྱིས་ བདག་ ལ་ སྐབས་ ཕྱེ་ ན །_
en: “If, in order to clarify questions, the Blessed One would allow me the opportunity,

source: བཅོམ་ལྡན་འདས་ ལ་ བདག་ ཕྱོགས་ འགའ་ཞིག་ ཞུ་ ལགས་སོ །_།
en: I will ask the Blessed One about some points.”

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ངས་ དྲི་བ་ ལན་ བཏབ་པ་ དེ་ དང་ དེ་ ཁོ་ན ས་ ཁྱོད་ ཀྱི་ སེམས་ རངས་པ ར་ བྱས །_
en: “Śāradvatī­putra, I will delight you with each answer I give.

source: དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ལ་ གང་དང་གང་ འདོད་པ་ དྲིས་ ཤིག _།
en: Ask whatever you wish of the Thus-Gone One, the Worthy One, the Perfect Buddha!”

source: བཅོམ་ལྡན་འདས་ སེམས་ཅན་ སྤྱོད་པ་ དང་ ཡོན་ཏན་ ཁྱད་པར་ཅན་ ལ་ རབ་ཏུ་ གནས་པ་ རྣམས་ ཀྱི་ དོན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ ལ་ ཞུ་ ལགས་སོ །_།
en: “Blessed One, I will ask the Thus-Gone One on behalf of beings who adhere to exalted conduct and qualities.

source: དེ་བཞིན་ གཤེགས་ ལ་ བདག་ གིས་ ཞུ་བ་ ནི །_། གང་དག་ སྤྱོད་ དང་ ཡོན་ཏན་ ཁྱད་འཕགས་ གནས །_། |#| ཡོ་བྱད་ བསྙུངས་ པ འི་ ཚུལ་ གྱིས་ འཕགས་ གྱུར་ ཅིང་ །_། དེས་ དང་ བཟོད་ བསྟེན་ སྨོན་ལམ་ ལྡན་ གྱུར་པ །_། མཁས་ རྣམས་ སྦྱིན་པ་ དེ་ འདྲ་ ཅི་ཞིག་ སྩོལ །_།
en: $1072 “I ask the Thus-Gone One the following: |#| There are some who adhere to exalted conduct and qualities, Who are exalted by way of observing abstinence, And who are gentle, patient, and filled with aspirations. |#| $1073 “How do these skilled beings practice generosity?

source: སྦྱིན་པ་ སྩལ་ ནས་ ཇི་ལྟ ར་ དགའ་བ ར་ འགྱུར །_།
en: Having given, how should they rejoice?

source: ཇི་ལྟ ར་ སེམས་ ནི་ ཡོངས་སུ་ བསྔོ་བ ར་ བགྱིད །_།
en: How should they mentally form the dedication?

source: འཇུངས་པ་ མ་ མཆིས་པ ར་ ཡང་ སྦྱིན་པ་ བགྱིད །_།
en: How should they give without any stinginess?

source: ཇི་ལྟ ར་ ཚུལ་ཁྲིམས་ སྟེན་པ ར་ བགྱིད །_།
en: $1074 “How should they observe discipline?

source: དེ་དག་ བཟོད་པ འང་ ཅི་འདྲ་ ལགས །_།
en: How should they have patience?

source: དེ་དག་ བརྩོན་འགྲུས་ ཅི་ ལྟ་བུ །_།
en: How should their effort be?

source: ཇི་ལྟ་བུ་ ཡི་ དེས་པ ར་ འགྱུར །_།
en: How will they become gentle?

source: སེམས་ཅན་ སྡུག་བསྔལ་ ལྡན་ མཐོང་ ན །_། |#| ཇི་ལྟ ར་ བསམ་པ་ སྟོན་པ ར་ བགྱིད །_།
en: $1075 “How, when seeing suffering beings, Should they direct their minds?

source: བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གི །_། བསམ་ [131a] པ་ འདྲེན་པ་ བཤད་ དུ་ གསོལ །_།
en: Please tell me, O Guide, about the thoughts Of those bodhisattvas! [131.a]

source: བསྐལ་པ་ བྱེ་བ་ བརྒྱ་ མང་ དུ །_། གོ་ཆ་ འཚལ་བ་ དེ་དག་ གི །_། ཇི་ལྟ ར་ སེམས་ ནི་ ཉོན་ མི་ མོངས །_།
en: $1076 “For those who wear armor For many billions of eons, How can their minds not be afflicted?

source: ཇི་ལྟ ར་ དེ་དག་ དགའ་བ་ བསྐྱེད །_།
en: How do they rejoice?

source: དེ་དག་ ཏིང་འཛིན་ ཇི་ལྟ་བུ །_།
en: $1077 “What is their absorption like?

source: དེ་དག་ ཤེས་རབ་ ཅི་འདྲ་ ལགས །_།
en: What is their insight like?

source: མང་ དུ་ ཐོས་པ འང་ ཇི་ ལྟ་བུ །_།
en: And how are they learned?

source: དེ་དག་ ཐོས་པ འང་ ཅི་འདྲ་ ཞིང་ །_།
en: What is their learning like?

source: མཉན་པ ར་ བགྱི་བ འི་ ཆོས་ གང་ ལགས །_།
en: $1078 “What are the teachings that they listen to?

source: སྤང་བ ར་ བགྱི་བ འི་ ཆོས་ གང་ ལགས །_།
en: What are the dharmas they abandon?

source: བྱང་ཆུབ་ སླད་ ཞུགས་ གང་དག་ ལགས །_། |#| དེ་དག་ གི་ ནི་ སྤྱོད་ཡུལ་ ཞུ །_།
en: I ask about the experience of those Who have set out for awakening.

source: ཇི་ལྟ ར་ དམ་ཆོས་ ཚོལ་ བར་ བགྱིད །_།
en: $1079 “How should they pursue the sublime Dharma?

source: དེ་དག་ འདུན་པ་ ཅི་འདྲ་ ལགས །_།
en: What is their aspiration like?

source: ཇི་ལྟ ར་ འདོད་པ་ རྣམ་པར་ སྤོང་ །_།
en: How do they abandon desire?

source: དེ་དག་ མངོན་ འབྱུང་ ཇི་ལྟ་བུ །_།
en: How do they go forth?

source: ཇི་ལྟ ར་ མངོན་པར་ འབྱུང་ རྣམས་ ཀྱི །_། དགའ་བ་ རྒྱ་ ཆེན་ སྐྱེ་བ ར་ འགྱུར །_།
en: $1080 “How do those who go forth Experience abundant joy?

source: ཇི་ལྟ ར་ རབ་ཏུ་ བྱུང་ ནས་ སུ །_། ཡོན་ཏན་ རྣམས་ ཀྱིས་ འཕགས་ ནས་ མཛེས །_།
en: How, having gone forth, Are they exalted and adorned by qualities?

source: ཇི་ལྟ ར་ སེམས་ ནི་ ངེས་པ ར་ གཞོལ །_།
en: $1081 “How do they firmly direct their minds?

source: དེ་དག་ ཐབས་ ནི་ ཅི་འདྲ་ ལགས །_།
en: What are their methods like?

source: ཇི་ལྟ ར་ ཚེ་རབས་ དྲན་པ ར་ འགྱུར །_།
en: How do they recollect past lives?

source: དེ་དག་ དྲན་པ་ ཇི་ལྟ་བུ །_།
en: What is their recollection like?

source: ཇི་ལྟ ར་ མངལ་ དུ་ ཞུགས་ རྣམས་ ཀྱི །_། བྱང་ཆུབ་ སེམས་ ནི་ འབྱུང་བ ར་ འགྱུར །_།
en: $1082 “How does the mind of awakening arise For those who have entered the womb?

source: རྫོགས་པ འི་ སངས་རྒྱས་ དེར་ མཐོང་ འགྱུར །_།
en: How will they see complete awakening there?

source: དེ་དག་ མཐོང་བ་ སླུ་ མི་ འགྱུར །_།
en: How will their vision be unmistaken?

source: ཇི་ལྟ ར་ འདོད་ཆགས་ ཆུང་ བ ར་ འགྱུར །_། |#| ཞེ་སྡང་ ཆུང་ ཞིང་ མི་ འཇིགས་ འགྱུར །_།
en: $1083 “How will their desire diminish, And their anger diminish, and how will they become fearless?

source: ཇི་ལྟ ར་ གཏི་མུག་ མི་ འགྱུར་ ཞིང་ །_། མ་ རྨོངས་པ ར་ ནི་ འགྱུར་བ་ ལགས །_།
en: How will their delusion disappear, So that they become unconfused?

source: ཇི་ལྟ ར་ རྒྱལ་པོ འི་ རིགས་ སྐྱེས་པ །_། མཁས་ རྣམས་ རྒྱལ་སྲིད་ བགྱིད་ དུ་ སྩོལ །_། |#| མི་ ཁོམ་ ཐམས་ཅད་ སྤངས་ ནས་ སུ །_། རྟག་ ཏུ་ གུས་ དང་ བཅས་པ ར་ འགྱུར །_།
en: $1084 “How will the skilled, born into the royal caste, Be conferred the kingdom to rule, And, having abandoned all unfavorable conditions, Become eternally respected?

source: ཇི་ལྟ ར་ རྒྱལ་སྲིད་ རབ་ བསྔགས་ ན །_། |#| བཞིན་འཛུམ་ ཁྲོ་བ ར་ མི་ བགྱིད་ ལགས །_།
en: $1085 “How, when the kingdom is praised, Will it not turn their smiles into wrath?

source: དེ་དག་ གི་ ནི་ རྣམ་རྒྱལ་ དེར །_། སངས་རྒྱས་ མཐོང་བ འང་ རྙེད་པ ར་ འགྱུར །_།
en: How will they attain a vision of buddhahood In that victory of theirs?#49

source: ཇི་ལྟ ར་ གཟུགས་ དང་ ལྡན་པ་ ལགས །_། |#| རྟག་ ཏུ་ ཚུལ་ དུ་ ཤིས་པ ར་ འགྱུར །_། |#| འཁོར་ དང་ ལྡན་པ ར་ འགྱུར་བ་ ལགས །_། བྱང་ཆུབ་ མཆོག་ ལ་ ཞུགས་པ་ ལགས །_།
en: $1086 “How will they become beautiful, Always prosperous, Accompanied by a retinue, And embark upon supreme awakening?

source: ཇི་ལྟ ར་ སྐྱེས་པ་ ཙམ་ གྱིས་ ཀྱང་ །_། ཁྱིམ་ ལ་ དགའ་བ ར་ མི་ འགྱུར་ ཞིང་ །_། མངོན་པར་ འབྱུང་ ལ་ གཞོལ་བ ར་ འགྱུར །_། |#| དེ་དག་ སྲེད་པ་ མ་ མཆིས་ འགྱུར །_།
en: $1087 “How, just upon birth, Will they be discontent with the household, Become intent on going forth, And lose all their craving?

source: ཇི་ལྟ ར་ རབ་ཏུ་ བྱུང་ ནས་ སུ །_། སངས་རྒྱས་ བྱང་ཆུབ་ [131b] འཛིན་པ་ ལགས །_། དེ་བཞིན་ གཤེགས་པ་ མྱ་ངན་ འདས །_།
en: $1088 “How, having gone forth, Will they uphold the awakening of the Buddha? [131.b]

source: ཇི་ལྟ ར་ དམ་ཆོས་ འཛིན་པ ར་ འགྱུར །_།
en: How, after the Thus-Gone One’s passing, Will they uphold the sublime Dharma?

source: ཇི་ལྟ ར་ འཇིག་རྟེན་ འཁྲུགས་པ་ ན །_། |#| འཁྲུག་པ ར་ མི་ བགྱིད་ མི་ འཇིགས་ འགྱུར །_། |#| འཇིག་རྟེན་ ཉམ་ཐག་ འཚལ་ ནས་ ཀྱང་ །_། དབུགས་ འབྱིན་ གྲགས་པ་ ཆེན་པོ ར་ འགྱུར །_།
en: $1089 “How, in the tumultuous world, Will they not be disturbed or afraid, And, understanding the torment of the world, Become a widely renowned savior?

source: ཇི་ ལྟ ར་ ཐོས་པ་ འཛིན་པ ར་ འགྱུར །_། |#| གཟུངས་ ཀྱི་ སྒོ་ ཡང་ ཐོབ་པ ར་ འགྱུར །_། |#| སྤོབས་པ་ ཐོགས་པ་ མ་ མཆིས་ ཤིང་ །_། སྲོག་ཆགས་ རྣམས་ ལ་ ཆོས་ འཛིན་ སྩོལ །_།
en: $1090 “How will they retain what they have heard, To obtain the gate of retention, And with unobstructed eloquence Bestow upon beings the Dharma so retained?

source: ཇི་ལྟ ར་ སེམས་ཅན་ གཞན་ རྣམས་ ཀྱི །_། གཞན་ གྱི་ སེམས་ དག་ འཚལ་བ་ ལགས །_།
en: $1091 “How will they know the minds Of other beings?

source: ཇི་ལྟ ར་ དགེ་བ་ མ་ ལགས་པ འི །_། སེམས་ ཚར་གཅོད་ ཅིང་ རྟག་ ཏུ་ དགེ །_།
en: How will they eliminate non-virtuous mental states, So that they are always virtuous?

source: བྱང་ཆུབ་ སེམས་དཔ འི་ དོན་ སླད་ དུ །_། ཞུ་བ ར་ འཚལ་ ན་ རྐང་ གཉིས་ མཆོག _། བྱང་ཆུབ་ སེམས་དཔ འི་ སྤྱོད་པ་ གང་ །_། |#| བདག་ གིས་ ཞུ་བ་ དེ་ བཤད་ གསོལ །_།
en: $1092 “And if I may request, best among humans, On behalf of bodhisattvas, What is the conduct of bodhisattvas? |#| Please teach on the questions I have asked.

source: སངས་རྒྱས་ ཆོས་ ཀྱི་ རྒྱུ་ སླད་ དུ །_། གང་དག་ གིས་ ནི་ སེམས་བསྐྱེད་པ །_། དེ་དག་ ལུང་བསྟན་ ཐོས་ གྱུར་ ནས །_། |#| དགའ་བ་ བཟང་པོ་ འབྱུང་བ ར་ འགྱུར །_།
en: $1093 “Those who have engendered the altruistic attitude For the sake of the qualities of the buddhas Will have sublime joy Upon hearing the elucidation of these issues.

source: སངས་རྒྱས་ ཡེ་ཤེས་ ཐོགས་ མ་ མཆིས །_།
en: $1094 “The wisdom of a buddha is unobstructed;

source: ཆོས་ རྣམས་ ཀུན་ ལ་ འཇུག་པ་ ལགས །_།
en: It partakes of all phenomena.

source: ཕྱོགས་ གཅིག་པ་ ཡི་ ཤེས་པ་ ཡིས །_། འཇིག་རྟེན་ འདྲེན་ ལ་ ཞུ་བ ར་ འཚལ །_།
en: With my partial knowledge, I wish to ask the Guide of the World these questions.

source: ཆོས་ རྣམས་ གང་དག་ མ་ ཞུས་པ །_། དེ་ ལ་ བདག་ གིས་ ཤེས་ མི་ འཇུག _།
en: $1095 “I do not understand those teachings That I have not properly enquired about.

source: བྱང་ཆུབ་ སེམས་དཔ འི་ སྤྱོད་པ་ གང་ །_། སྟོན་པ ས་ དེ་ ནི་ བསྟན་ དུ་ གསོལ །_།
en: May the teacher please teach What bodhisattvas’ conduct is!”

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ལེགས་ སོ་ ལེགས་ སོ །_།
en: “Well done, well done, Śāradvatī­putra!
